20240218T162607--kdoc-98-org-roam-node-findでエントリが出なくなったときの直し方__code.org
:properties:
:ID: 20240218T162607
:end:
#+title:      KDOC 98: org-roam-node-findでエントリが出なくなったときの直し方
#+date:       [2024-02-18 Sun 16:26]
#+filetags:   :code:
#+identifier: 20240218T162607

* この文書のステータス
- 作成
  - [X] 2024-02-18 貴島
- レビュー
  - [X] 2024-02-25 貴島
* 概要
外部でファイルリネームして、 ~org-roam-node-find~ の一覧に出なくなったときの対処方法。キャッシュに保存されているので、シャットダウンしても解決しない。
* イントロ
[[id:815a2c31-7ddb-40ad-bae0-f84e1cfd8de1][Org-roam]]は[[id:1ad8c3d5-97ba-4905-be11-e6f2626127ad][Emacs]]のメモプラグイン。 ~org-roam-node-find~ はエントリの一覧を表示する関数。
* やり方

1. M-x =org-roam-db-clear-all=

   SQLiteファイルとキャッシュをすべて削除する。

2. M-x ~org-roam-db-sync~

   ファイルを元にエントリを保存するSQLiteファイルを構成する。

* 関連
- [[id:20221026T102641][KDOC 1: denoteを使う]]。denoteを使っていると割とファイル名を変えるので、そのときにおかしくなる
