20240218T162607--kdoc-98-org-roam-node-findでエントリが出なくなったときの直し方__code.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2024-04-30 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>KDOC 98: org-roam-node-findでエントリが出なくなったときの直し方</title>
<meta name="generator" content="Org mode">
<meta name="author" content="root">
<link rel='shortcut icon' type='image/x-icon' href='/roam/favicon.ico' /><link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/bootstrap@5.0.2/dist/css/bootstrap.min.css' /><link rel='stylesheet' href='https://cdnjs.cloudflare.com/ajax/libs/font-awesome/5.15.4/css/all.min.css' /><link rel='stylesheet' href='../css/site.css' /><link rel='stylesheet' href='../roam/css/code.css' /><link rel='stylesheet' href='css/site.css' /><link rel='stylesheet' href='css/code.css' />
</head>
<body>
<div id="preamble" class="status">
<div><div class="header"><div class="container"><div class="row"><div class="col-sm-12 col-md-12"><nav class="navbar navbar-light"/></div></div></div></div></div>
</div>
<div id="content">
<h1 class="title">KDOC 98: org-roam-node-findでエントリが出なくなったときの直し方</h1>

<div id="outline-container-org1b94c3c" class="outline-2">
<h2 id="org1b94c3c"><a href="#org1b94c3c">この文書のステータス</a></h2>
<div class="outline-text-2" id="text-org1b94c3c">
<ul class="org-ul">
<li>作成
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 2024-02-18 貴島</li>
</ul></li>
<li>レビュー
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 2024-02-25 貴島</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org69f5849" class="outline-2">
<h2 id="org69f5849"><a href="#org69f5849">概要</a></h2>
<div class="outline-text-2" id="text-org69f5849">
<p>
外部でファイルリネームして、 <code>org-roam-node-find</code> の一覧に出なくなったときの対処方法。キャッシュに保存されているので、シャットダウンしても解決しない。
</p>
</div>
</div>
<div id="outline-container-org5833317" class="outline-2">
<h2 id="org5833317"><a href="#org5833317">イントロ</a></h2>
<div class="outline-text-2" id="text-org5833317">
<p>
<a href="20210508233810-org_roam.html#ID-815a2c31-7ddb-40ad-bae0-f84e1cfd8de1">Org-roam</a>は<a href="20210508234743-emacs.html#ID-1ad8c3d5-97ba-4905-be11-e6f2626127ad">Emacs</a>のメモプラグイン。 <code>org-roam-node-find</code> はエントリの一覧を表示する関数。
</p>
</div>
</div>
<div id="outline-container-orgf3922e6" class="outline-2">
<h2 id="orgf3922e6"><a href="#orgf3922e6">やり方</a></h2>
<div class="outline-text-2" id="text-orgf3922e6">
<ol class="org-ol">
<li><p>
M-x <code>org-roam-db-clear-all</code>
</p>

<p>
SQLiteファイルとキャッシュをすべて削除する。
</p></li>

<li><p>
M-x <code>org-roam-db-sync</code>
</p>

<p>
ファイルを元にエントリを保存するSQLiteファイルを構成する。
</p></li>
</ol>
</div>
</div>

<div id="outline-container-org23bf3e0" class="outline-2">
<h2 id="org23bf3e0"><a href="#org23bf3e0">関連</a></h2>
<div class="outline-text-2" id="text-org23bf3e0">
<ul class="org-ul">
<li><a href="20221026T102641--kdoc-1-denoteを使う__essay.html#ID-20221026T102641">KDOC 1: denoteを使う</a>。denoteを使っていると割とファイル名を変えるので、そのときにおかしくなる</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer class="footer py-3"><div class="container"><div class="row "><div class="col-md-4"></div><div class="col-sm col-md"><nav class="navbar"><a class="nav-link text-secondary small px-0" href="./index.html">Insomnia</a><a class="nav-link text-secondary small px-0" href="./sitemap.html">Sitemap</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD/roam">Repository</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD">@kijimaD</a></nav></div><div class="col-md-4"></div></div></div></footer><script src="https://cdn.jsdelivr.net/npm/bootstrap@5.0.2/dist/js/bootstrap.bundle.min.js"/>
</div>
</body>
</html>
